import React from 'react';
import './musicians.css';
import { Musician } from "../../components";

import Epoday from '../../assets/Epoday.jpeg';
import goji from '../../assets/goji.jpeg';
import kanarite from '../../assets/kanarite.jpeg';
import Kuku from '../../assets/Kuku.jpeg';
import Sofiiskisolisti from '../../assets/Sofiiskisolisti.jpeg';

import stokila from '../../assets/stokila.jpeg';
import dim4ou from '../../assets/dim4ou.jpeg';
import krisko from '../../assets/krisko.jpeg';
import shatrata from '../../assets/shatrata.jpeg';
import ustata from '../../assets/ustata.jpeg';

import preslava from '../../assets/preslava.jpeg';
import galena from '../../assets/galena.jpeg';
import alisia from '../../assets/alisia.jpeg';
import grahich from '../../assets/grahich.jpeg';
import Toni from '../../assets/Toni.jpeg';

import BTR from '../../assets/BTR.jpeg';
import D2 from '../../assets/D2.jpeg';
import Monolit from '../../assets/Monolit.jpeg';
import Zona from '../../assets/Zona.jpeg';
import Signal from '../../assets/Signal.jpeg';

import Rachkov from '../../assets/Rachkov.jpeg';
import Zueka from '../../assets/Zueka.jpeg';
import Gero from '../../assets/Gero.jpeg';
import Viktor from '../../assets/Viktor.jpeg';
import Krasi from '../../assets/Krasi.jpeg';

import Drenci from '../../assets/Drenci.jpeg';
import Arabesk from '../../assets/Arabesk.jpeg';
import Trakiq from '../../assets/Trakiq.jpeg';
import Kuklenche from '../../assets/Kuklenche.jpeg';
import Horce from '../../assets/Horce.jpeg';

import Rosica from '../../assets/Rosica.jpeg';
import Nikolay from '../../assets/Nikolay.jpeg';
import Petq from '../../assets/Petq.jpeg';
import Poli from '../../assets/Poli.jpeg';
import Kalina from '../../assets/Kalina.jpeg';

import Jeryco from '../../assets/Jeryco.jpeg';
import Damyan from '../../assets/Damyan.jpeg';
import Bobo from '../../assets/Bobo.jpeg';
import Diass from '../../assets/Diass.jpeg';
import Dimo from '../../assets/Dimo.jpeg';

import Miro from '../../assets/Miro.jpeg';
import Tita from '../../assets/Tita.jpeg';
import Ilieva from '../../assets/Ilieva.jpeg';
import Vasil from '../../assets/Vasil.jpeg';
import Silviq from '../../assets/Silviq.jpeg';


const Musicians = () => {
  const genres = [
    {
      name: "Чалга изпълнители",
      xox: "Popfolk",
      musicians: [
        { name: "Преслава", imageSrc: preslava, text: "Преслава е родена на 26 юни 1984 г. в Добрич, България. Тя е една от най-успешните поп фолк певици в България, започвайки своята кариера през 2004 г. Преслава се отличава със своя мощен и емоционален глас и бързо става водеща фигура в жанра. Тя има множество хитове и албуми, които са любими на публиката. Преслава е носител на редица награди, включително „Певица на годината“ и други престижни отличия в музикалната индустрия. " },
        { name: "Галена", imageSrc: galena, text: "Галена е родена на 21 май 1985 г. в Смядово, България. Тя започва своята музикална кариера в средата на 2000-те години и бързо се утвърждава като една от най-популярните и иновативни поп фолк изпълнителки. Галена е известна със своите енергични изпълнения, модерни видеоклипове и стилни визии. Тя редовно издава нови песни и албуми, които се радват на голям успех и често оглавяват класациите. Галена е носител на множество музикални награди и се радва на висока популярност сред публиката. " },
        { name: "Алисия", imageSrc: alisia, text: "Алисия е родена на 1 март 1983 г. в Ихтиман, България. Тя започва своята музикална кариера в началото на 2000-те години и бързо печели популярност със своите модерни поп фолк песни. Алисия е известна със стилния си имидж и енергични изпълнения. През годините тя издава множество успешни албуми и сингли, които често оглавяват музикалните класации в България. Освен с музика, Алисия се занимава и с модни проекти и телевизионни изяви. Тя е получила множество награди и признания в музикалната индустрия. " },
        { name: "Грахич", imageSrc: grahich, text: "Цветелина Грахич е родена на 11 януари 1991 г. в Босна и Херцеговина. Тя започва своята музикална кариера като част от бенда на популярното шоу „Шоуто на Слави“. След това тя преминава към солова кариера и започва да издава свои собствени песни в поп фолк жанра. Цветелина е известна със своя уникален глас и талант, които й помагат бързо да спечели популярност. Тя работи усилено върху своята музикална кариера и продължава да развива своя стил и репертоар. " },
        { name: "Тони Стораро", imageSrc: Toni, text: "Тони Стораро е роден на 2 август 1976 г. в Шумен, България. Той е един от най-известните и успешни поп фолк изпълнители в България. Тони Стораро започва своята музикална кариера през 90-те години и бързо се утвърждава като водеща фигура в жанра. Неговите песни са известни със своите запомнящи се мелодии и текстове, които докосват сърцата на публиката. Тони Стораро има множество награди и признания за своето творчество и продължава да бъде активно присъствие на музикалната сцена в България. " }
      ]
    },
    {
      name: "Поп и Естрада",
      xox: "Pop",
      musicians: [
        { name: "Миро", imageSrc: Miro, text: "Мирослав Костадинов (Миро) е български поп певец, композитор и текстописец. Той става известен като част от дуото „КариZма“ заедно с Галя Курдова, създавайки хитове като „Минаваш през мен“. След разпадането на дуото, Миро продължава солова кариера, издавайки успешни албуми и песни като „Губя контрол“, „Някога преди“ и „Повече“. Миро също представлява България на Евровизия през 2010 г. с песента „Ангел си ти“. " },
        { name: "Тита", imageSrc: Tita, text: "Христина Христова( Тита), е българска поп и рап певица. Тя започва кариерата си като участник в телевизионния формат X Factor България. Тита става известна след като подписва договор с продуцентската компания на Криско и издава хитови песни като „Voodoo kukla“, „Антилопа“ и „Първа среща“. Тита се отличава със своя модерен стил и е популярна сред младите хора. " },
        { name: "Мария Илиева", imageSrc: Ilieva, text: "Мария Илиева е една от най-известните български поп певици, също така композитор и музикален продуцент. Тя започва кариерата си през 90-те години и става популярна с песни като „Нищо“, „Всичко“ и „Идвам към теб“. Мария Илиева има няколко успешни албума и е получавала множество музикални награди. Тя е известна и с участието си в различни телевизионни музикални формати като жури. " },
        { name: "Васил Найденов", imageSrc: Vasil, text: "Васил Найденов е един от най-емблематичните български поп и естрадни изпълнители, известен със своя мощен глас и силни изпълнения. Той става популярен през 70-те и 80-те години с хитове като „Телефонна любов“, „Синева“ и „Адаптация“. Васил Найденов е известен със своите емоционални и драматични изпълнения и е оставил незабравими песни в българската музикална история. " },
        { name: "Силвия Кацарова", imageSrc: Silviq, text: "Силвия Кацарова е ветеран на българската поп сцена и е известна като водеща вокалистка на групата „LZ“. Групата се прославя през 80-те години с хитове като „Големият кораб минава“, „Обещай ми любов“ и „Топъл дъжд“. След разпадането на групата, Силвия Кацарова продължава солова кариера, издавайки няколко успешни албума и оставайки активна на музикалната сцена. " }
      ]
    },
    {
      name: "Групи",
      xox: "Groups",
      musicians: [
        { name: "Ансамбъл “Еподай”", imageSrc: Epoday, text: 'Ансамбъл “Еподай” има за своя мисъл да събира, съхранява и изпълнява родна и народна музика. В ансамбъла има гайдарски и певчески ансамбли, както и талантливи солисти и музиканти. Ансамбълът не само изнася концерти, но и активно работи за обучението на нови поколения музиканти чрез своята школа, където се преподават гайда, народно пеене и други традиционни инструменти и техники. “Еподай” участва в множество културни събития и фестивали, популяризирайки богатството на българския фолклор и вдъхновявайки млади таланти да продължат тази богата музикална традиция. Групата се стреми да запази и развие националното музикално наследство, като предлага автентични и съвременни интерпретации на традиционни песни и мелодии. ' },
        { name: "Годжи (Георги Милчев)", imageSrc: goji, text: "Годжи (Георги Милчев) е популярен български музикант, певец и бас китарист, най-известен като дългогодишен член на Ку-Ку Бенд. Роден на 24 септември 1969 г. в Враца, той започва музикалната си кариера в началото на 90-те години. Годжи е известен със своя харизматичен сценичен образ и забележителни музикални умения. Освен че свири на бас китара, той често изпълнява вокали и е автор на някои от песните на Ку-Ку Бенд.  " },
        { name: "Канарите", imageSrc: kanarite, text: "Канарите е известна българска оркестрова формация, специализирана в народната музика и по-специално в тракийския фолклор. Оркестърът е създаден през 1972 г. от Атанас Стоев в Пловдив и бързо се утвърждава като един от водещите фолклорни ансамбли в България. Канарите са известни със своето майсторство в изпълнението на народни песни и танци, които често включват традиционни инструменти като гайда, кавал и акордеон. Групата има богата дискография и множество концерти както в България, така и в чужбина.  " },
        { name: "Ку-Ку бенд", imageSrc: Kuku, text: 'Ку-Ку Бенд е емблематична българска музикална група, създадена през 1993 г. Групата е основана от музикалния продуцент и телевизионен водещ Слави Трифонов. Ку-Ку Бенд е известна със своето разнообразие от музикални стилове, включително поп, рок, етно и фолклор, което я прави уникална на българската музикална сцена. През годините групата издава множество албуми и хитове, като "Жива рана", "Едно Ферари с цвят червен" и "Няма такава държава".  ' },
        { name: "Софийски солисти", imageSrc: Sofiiskisolisti, text: 'Камерен ансамбъл “Софийски солисти” е престижна българска музикална формация, основана през 1962 г. в София. Ансамбълът е съставен от изтъкнати музиканти и инструменталисти, които изпълняват широка гама от музикални произведения, вариращи от барок до съвременна музика. Техният репертоар включва както класически, така и съвременни произведения, като те работят съвместно с множество известни диригенти и солисти от цял свят. ' }
      ]
    },
    {
      name: "Рок изпълнители",
      xox: "Rock",
      musicians: [
        { name: "БТР", imageSrc: BTR, text: 'БТР е българска музикална група, основана през 1982 г. Групата е популярна през 80-те и 90-те години и има множество хитове като “Някой друг”, “Скрита магия” и “Забрави ме”.  ' },
        { name: "Д2", imageSrc: D2, text: 'D2 е българска музикална група, основана през 1998 г. Групата е популярна с хитове като “Версай” и “Пази нос на майка си”.  ' },
        { name: "Монолит", imageSrc: Monolit, text: 'Монолит е българска рок група, създадена през 1984 г. Те са известни с песни като “Безсъние” и “Слънчева батерия”.  ' },
        { name: "Зона Ц", imageSrc: Zona, text: 'Сигнал е българска рок група, основана през 1982 г. Групата има голям брой хитове като “Мечтая” и “Грях”.  ' },
        { name: "Сигнал", imageSrc: Signal, text: 'Зона Ц е българска алтернативна рок група, сформирана през 1981 г. Те са популярни с песни като “Наричане” и “Денят на растенето”. ' }
      ]
    },
  
    
      {
        name: "Рапъри",
        xox: "Rap",
        musicians: [
          { name: "Stokila", imageSrc: stokila, text: "100 кила- Явор Димитров Янакиев, по-известен като 100 Кила, е български рап и хип- хоп изпълнител и музикален продуцент от Варна. Известен е с песните си „Цяла нощ“, която е дует с Лора Караджова, „Аз съм 6“, „Антистоп“, „Газ До Дупка“, „Ланец на врата ми“ и други. Носител е на 6 награди „Рапър на годината“. " },
          { name: "Dim4ou", imageSrc: dim4ou, text: "Димчо -Димчо, който започва своята музикална кариера на 14 години, днес е един от най-известните рап изпълнители в България. Той е известен с уникалните си текстове и музикални проекти, които първоначално пише на листове и събира в кутии от обувки.. Той е работил съвместно с множество други изпълнители и продуценти, включително Евгени Иванов – EVG. " },
          { name: "Krisko", imageSrc: krisko, text: "Криско (Кристиан Талев) е популярен български рапър, певец, продуцент и текстописец. Роден на 11 май 1988 г. в София, той става известен със своите хитови парчета, които съчетават рап, поп и хип-хоп. Криско започва музикалната си кариера през 2005 г. и бързо набира популярност. Освен успешната си соло кариера, Криско е и продуцент на редица млади таланти в България. Към 2018 има собствено студио – Krisko Beats, където разработва както своите проекти, така и тези на изгряващи изпълнители. " },
          { name: "Shatrata", imageSrc: shatrata, text: "Румънеца и Енчев - Това е български дует, съставен от Любомир Румънеца и Димитър Енчев. Те са активни във вокалния си живот от 90-те години и първите месеци на 2000-те години и са известни с хитовите си песни и енергичните си изпълнения. " },
          { name: "Ustata", imageSrc: ustata, text: "Устата- Иван Динев Георгиев, познат на публиката с артистичния си псевдоним Устата, е български певец и актьор, роден в село Трояново, става един от най- известните рапъри в България. " }
        ]
      },
      {
        name: "Народни изпълнители",
        xox: "Folk",
        musicians: [
          { name: "Росица Пейчева", imageSrc: Rosica, text: "Росица Пейчева е родена на 17 април 1942 г. и е една от най-известните български народни певици. Тя е получила много награди за своя труд в запазването на българския фолклор и е записала множество албуми.  " },
          { name: "Николай Славеев", imageSrc: Nikolay, text: 'Николай Славеев е роден на 8 април 1942 г. и е известен като “крал на кючеците”. Той е известен със своя мощен глас и стилно изпълнение на българските народни песни.  ' },
          { name: "Петя Панева", imageSrc: Petq, text: 'Петя Панева е родена на 16 ноември 1940 г. и е известна като “кралица на българския фолклор”. Тя е записала много албуми и е активно участвала в запазването на българската фолклорна традиция.  ' },
          { name: "Поли Паскова", imageSrc: Poli, text: 'Поли Паскова е народна певица и музикант с богат опит в изпълнението на български фолклорни песни. Тя е известна също и със сътрудничеството си с други известни изпълнители в областта на фолклорната музика.  ' },
          { name: "Калина и Невена", imageSrc: Kalina, text: 'Калина и Невена са сестри, които се изявяват като народни певици и са популярни с изпълненията си на български народни песни. Те често се появяват на фолклорни фестивали и концерти. ' }
        ]
      },
      {
        name: "Танцови състави и танцьори",
        xox: "Dancer",
        musicians: [
          { name: "Фолклорен танцов състав “Кукленче”", imageSrc: Kuklenche, text: 'Фолклорен танцов състав "Кукленче"  е създаден през септември 2010 г. към НЧ "Никола Вапцаров" в град Куклен, област Пловдив с ръководител Сашо Ламбрев. Този състав не просто танцуват народни танци, а създават разнообразни сценични постановки, където влизат в различни роли, облечени в прекрасни народни носии. Участвали са в множество фестивали и събития в България, както и в състезания, на които заемат челните позиции и се нареждат до едни от най-добрите. В ансамбълът се създават професионалисти от всяка възрастова група. Също така част от него взимат и няколко певици, чиито гласове се носят и извън границите на България. Вече 7 години те представят нашата страна на международния фестивал в Италия, в който взимат участие групи от цял свят. Всеки един техен танц е изпълнен с динамика и емоция, те оставят дълбоко впечатление в съзнанието на всеки зрител, пренасяйки го в магията на българския фолклор. Уникалните народни носии, изящните танци и прекрасните песни създават атмосфера на радост и гордост от богатото културно наследство, което България има. ' },
          { name: "Фолклорен танцов състав “Дренци”", imageSrc: Drenci, text: 'Фолклорен танцов състав "Дренци" с ръководител Владислав Кирилов е създаден през месец май 2022 г. Това е не просто танцов състав, а приятели, играещи от сърце и душа. Те взимат участия в различни събори и концерти и стоплят душите на хората, като им показват, че българското хоро може да прави чудеса, а именно да сближава хората. Всяка една стъпка е изиграна с любов и желание. "Когато душата играе и краката играят" - това е тяхното мото.  ' },
          { name: "Ансамбъл “Тракия”", imageSrc: Trakiq, text: 'Ансамбъл "Тракия" е един от най-известните и уважавани фолклорни ансамбли в България, основан през 1974 г. в Пловдив. Ансамбълът е посветен на съхраняването и популяризирането на българските народни традиции, обичаи и музика, със специален акцент върху фолклора на Тракия. В състава му влизат професионални танцьори, музиканти и певци, които изпълняват автентични народни песни, танци и музикални произведения с изключителна прецизност и страст.  ' },
          { name: "Танцова формация “Хорце”", imageSrc: Horce, text: 'Танцова формация "Хорцѐ" е престижен български ансамбъл от град Пазарджик, специализиран в изпълнението на традиционни български народни танци. Основана с цел да съхранява и популяризира богатото фолклорно наследство на България, формацията включва талантливи танцьори и хореографи, които пресъздават автентични народни обичаи и ритуали чрез своите изпълнения. "Хорцѐ" е известна със своите динамични и емоционални представления, които комбинират сложни танцови движения с колоритни народни костюми и музика. ' },
          { name: "Балет “Арабеск”", imageSrc: Arabesk, text: 'Балет „Арабеск“ е държавна професионална танцова група за модерен балет в София. Тя е единствената в страната балетна трупа извън оперните състави, която се радва на половинвековно дълголетие. Известна е с иновативните си идеи и изпълнения, които включват разнообразни стилове и теми.  ' }
        ]
      },
      {
        name: "Диджеи",
        xox: "DJ",
        musicians: [
          { name: "DJ Jeryco", imageSrc: Jeryco, text: "DJ Jerycо-Георги Петров, по-известен като Джерико , е български диджей. Родом е от град Пловдив и е в бранша повече от 20 години. Той е един от най-желаните диджеи и водещи на сватби и други подобни събития. Освен качествата на Диджей и водещ,с които той разполага, Джерико също така умее и да пее и никога не пропуска събитие, в което със завладяващия си глас да докосне всеки присъстващ." },
          { name: "DJ Дамян", imageSrc: Damyan, text: "2. DJ Damyan-Вече 26 години в бранша, DJ Дамян е главният виновник за доброто настроение на много българи. Най-известният диджей от златното поколение – без право на второ мнение. Харесван дори от майките в BG Mamma (имат вкус… ма ня’ат шанс). По време на карантината и извънредното положение през 2020 г. DJ Дамян се превърна в хегемон на онлайн дискотеките и десетките хиляди музикални манЯци по света и у нас. А след карантината – в доминатор на частните партита (рождени дни, кръщенета, банкети, сватби… а защо не и разводи :).Той е закона на купона!  "},
          { name: "DJ Bobo", imageSrc: Bobo, text: "3. Dj Bobo - Борислав Борисов Димитров, известен с артистичния си псевдоним Бобо, е български рапър, певец, DJ, текстописец, композитор, актьор с гвинейски корени. " },
          { name: "DJ Diass", imageSrc: Diass, text: "4. DJ Diass- Българският диджей и продуцент Diass започва да пуска музика на 12-годишна възраст. Именно това излагане в ранна възраст определя страстта му и оформя музиката, която пише днес. Диас е един от малкото български диджеи с музикално образование – има повече от 6 години обучение по продуциране, озвучаване и студийно инженерство. " },
          { name: "DJ Dimo", imageSrc: Dimo, text: 'DJ Dimo BG е роден в семейство на музиканти през 1983 г. Започва работата си като DJ в края на 90-те години. През 2005 печели Националния Конкурс за DJ с награда “Най-добър House DJ” През годините застава зад пулта на редица емблематични клубове:  Hacienda Beach, Alcohol Лозенец, Cacao Beach, Bedroom Beach, Lazur, Bedroom Premium Club, Mascara, Mania, Dirty Gradina, Culture Beat, Yalta, Escape т.н. През 2011та е избран отново за “Най-добър House Dj” (Awards BG). ' }
        ]
      },
      {
        name: "Комедианти",
        xox: "Comedy",
        musicians: [
          { name: "Димитър Рачков", imageSrc: Rachkov, text: 'Димитър Рачков е известен български актьор, режисьор и педагог. Той е роден на 23 септември 1946 г. и е известен с ролите си във филми като “Балканският спасител” и “Годината на планината”.   ' },
          { name: "Васил Василев-Зуека", imageSrc: Zueka, text: 'Васил Василев-Зуека е български актьор, роден на 2 февруари 1952 г. Той е популярен с ролите си в комедийни филми и сериали като “Дивият Запад на Милко Бабовски” и “Кучета на игла”.  ' },
          { name: "Краси Радков", imageSrc: Krasi, text: 'Краси Радков е известен български актьор, режисьор и сценарист. Той е роден на 15 май 1933 г. и е известен с участието си във филми като “Дяволът и неговият ангел” и “Стъклен дом”.  ' },
          { name: "Герасим Георгиев-Геро", imageSrc: Gero, text: 'Герасим Георгиев, известен като Геро, е български актьор и комик. Той е роден на 21 август 1963 г. и е популярен с участието си в комедийни програми и сериали като “Смешни хора”.' },
          { name: "Виктор Калев", imageSrc: Viktor, text: 'Виктор Калев е български актьор и режисьор, роден на 23 април 1951 г. Той е известен с ролите си във филми като “Мастило за бронзови години” и “Дебелият президент”. ' }
        ]
      }
    ];

  return (
    <div className="musicans_main" id="musicians">
      <h2 className="musicans_title">Това са нашите:</h2>
      <div className="musicans_box">
        {genres.map((genre, genreIndex) => (
          <div className="genre_container" key={genreIndex}>
            <h3 className="genre_text" id={genre.xox}>{genre.name}</h3>
            {genre.musicians.map((musician, musicianIndex) => (
              <Musician
                key={musicianIndex}
                index={musicianIndex} // Pass the index of musician within its genre
                name={musician.name}
                imageSrc={musician.imageSrc}
                text={musician.text} 
              />
            ))}
          </div>
        ))}
      </div>
    </div>
  );
};

export default Musicians;
