import React from 'react';
import main_pic from '../../assets/main.jpg';
import './header.css';

const Header = () => (
  <div className="gpt3__header section__padding" id="home">
    <div className="gpt3__header-content">
      <h1 className="gradient__text">RIYA EVENTS <br/> Кои сме ние?</h1>
      <p>RIYA Events е като виртуална мозайка от таланти, която въплъщава вълнуваща и разнообразна гама от изпълнители - певци, диджеи, групи, оркестри, гайдари и танцови трупи, готови да оживят всяко едно събитие. <br/><br/>Всеки изпълнител е като главен герой от различен жанр - от драма до комедия, от романтика до екшън.<br/><br/>
Техните гласове водят публиката на емоционално пътешествие, което започва с дълбоките ноти на класическата музика, продължава с ритъма на популярните хитове и завършва с изкушаващите мелодии на народната музика.<br/><br/>
Благодарение на нашата фирма организирането на събитие се превръща в изкуство, където всяка нота, всяко движение и всяка дума се превръщат във вълшебно изживяване.<br/><br/> Нашата мисия е да осигури не просто изпълнители, а незабравими моменти, които ще останат в сърцата и спомените на всички присъстващи.</p>


    </div>

    <div className="gpt3__header-image">
      <img src={main_pic} />
    </div>
  </div>
);

export default Header;